app/Models/dashboardmodel.php

    public function getLoggedInUserData($id)
    {
        $builder = $this->db->table('users');
        $builder->where('id', $id);
        $builder->join('role','role.r_id = users.role');
        $result = $builder->get();
---
SELECT *
FROM `users`
JOIN `role` ON `role`.`r_id` = `users`.`role`
WHERE `id` = '8'

    public function getLoginUserInfo()
    {
        $builder = $this->db->table('login_activity');
        // $builder->where('user',$id);
        $builder->join('users','users.id = login_activity.user');

        $builder->orderBy('la_id', 'DESC');
        $builder->limit(10);
        $result = $builder->get()->getResult();
---
SELECT *
FROM `login_activity`
JOIN `users` ON `users`.`id` = `login_activity`.`user`
ORDER BY `la_id` DESC
 LIMIT 10