app/Models/itemmodel.php

    public function getTaluka()
    {
        $db = \config\Database::connect();
        $builder = $db->table('mh_pin');
        $builder->distinct();
        $builder->select('taluka');
        $builder->orderBy('taluka', 'ASC');
        $result = $builder->get()->getResult();
---
SELECT DISTINCT `taluka`
FROM `mh_pin`
ORDER BY `taluka` ASC

    public function getDist()
    {
        $db = \config\Database::connect();
        $builder = $db->table('mh_pin');
        $builder->distinct();
        $builder->select('dist');
        $builder->orderBy('dist', 'ASC');
        $result = $builder->get()->getResult();
---
SELECT DISTINCT `dist`
FROM `mh_pin`
ORDER BY `dist` ASC

    public function getpin($pin)
    {
        $builder = $this->db->table('mh_pin');
        $builder->where('pincode', $pin);
        $result = $builder->get();
---
SELECT *
FROM `mh_pin`
WHERE `pincode` = '414208'