app/Models/neemodel.php

SELECT *
FROM `consignee`
JOIN `destination` ON `destination`.`d_id` = `consignee`.`nee_city`
ORDER BY `nee_name` ASC
---
   public function neeList(){
      $db= \Config\Database::connect();
      $builder = $db->table('consignee');
      // $builder->select('*');
      $builder->join('destination', 'destination.d_id = consignee.nee_city');
      // $builder->join('mop', 'mop.id = consignor.nor_payment_type');
      $builder->orderBy('nee_name', 'ASC');
      $query = $builder->get()->getResult();