app/Models/normodel.php

   public function getNor($norid){
      $db= \config\Database::connect();
      $builder = $db->table('consignor');
      $builder->where('nor_id', $norid);
    //   $builder->join('destination', 'destination.d_id = consignor.nor_city');
    //   $builder->join('mop', 'mop.id = consignor.nor_payment_type');
    //   $builder->orderBy('nor_id', 'DESC');

      $result= $builder->get()->getRow();
---
SELECT *
FROM `consignor`
WHERE `nor_id` = '59'

   public function checkDuplicateOnUpdateNor($norname, $id)
   {
       $db = \config\Database::connect();
       $builder = $db->table('consignor');
       $builder->where('nor_name', $norname);
       $builder->where('nor_id !=', $id);
       $result = $builder->get();
---
SELECT *
FROM `consignor`
WHERE `nor_name` = 'krishna'
AND `nor_id` != '59'

   public function norList(){
      $db= \Config\Database::connect();
      $builder = $db->table('consignor');
      // $builder->select('*');
    //   $builder->join('destination', 'destination.d_id = consignor.nor_city');
    //   $builder->join('mop', 'mop.id = consignor.nor_payment_type');
    //   $builder->orderBy('nor_name', 'DESC');
      $query = $builder->get()->getResult();
---
SELECT *
FROM `consignor`

public function deleteNor($nid)
{
   $builder = $this->db->table('consignor');
        $builder->where('nor_id',$nid);
        $builder->delete();
---
DELETE FROM `consignor`
WHERE `nor_id` = '59'