app/Models/selectmodel.php

SELECT *
FROM `destination`
ORDER BY `city` ASC
---
    public function locationSelect(){
      $builder = $this->db->table('destination');
      $builder->orderBy('city', 'ASC');

        $result = $builder->get()->getResult();